function App() {
	return (
		<h1>Hello</h1>
	);
}

export default App;

/*
SSR Vs CSR

SSR -Server dide REndering
-페이지 이동시마다 일일이 서버쪽에 HTMl 파일을 요청해서 가져오는 방식
- 장점 : 초기로딩 속도가 빠름, 검색엔진 최적화 (SEO 좋음)
- 단점 : 페이지 이동시마다 일일이 서버쪽에 파일을 요청해야 되므로 페이지 깜빡거림

CSR - Client Side Rendering
- 초기에 빈 HTML 파일을 서버쪽에서 가져오고 화면에 출력될 모든 데이터를 자바스크립트로 Chunck단위의 
모든 데이터 파일 가져온 후 HTML 파일에 동적으로 출력

- 장점 : 한번ㅇ에 서브페이지포함한 모든 데이터를 불러오기 때문에 페이지 이동시마다 새롭게 파일을 요청할 필요가 없기 때문에 페이지 전환 자연스러움

-단점 : 모든 페이지에 대한 데이터를 한번에 다 가져오기 때문에 초기 로딩 속도가 SSR 박식에 비해선 늦음, 검색엔진 최적화 안됨
*/
